Homework/HW6/HW6_Sp15.tex
% Created 2015-03-24 Tue 11:44
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage{setspace}
\usepackage[labelfont=bf]{caption}
\usepackage{amsmath}
\usepackage{enumerate}
\usepackage[parfill]{parskip}
\usepackage[version=3]{mhchem}
\date{Due: \textit{<2015-04-02 Thu>}}
\title{}
\begin{document}

\title{Homework 6\\Computational Chemistry\\(CBE 60547)}
\author{Prof.\ William F.\ Schneider}
\maketitle

The goal of this assignment is to study bonding behavior of adsorbates on transition metal surfaces.

\begin{itemize}
\item You will work in randomly generated groups of two for this homework.

\item Each group will be work on three transition metals and submit one assignment.

\item All (7) groups will work in a directory on Prof. Schneider's afs space. This directory can accessed by typing \verb~cd $HW6~ on your terminal.

\item Within this directory you will see sub-directories for each group. Please work in the directory assigned for your group.

\item To ensure that we can compare trends across all your results, you will follow a strict naming convention for your directories. 
\begin{itemize}
\item The naming convention for each calculation has been provided in the appropriate section.
\item Deviations from the naming convention will be reflected on your grade.
\end{itemize}

\item For all calculations, a planewave cutoff of 400 eV and the PBE exchange-correlation functional should be used.
\end{itemize}

Here is some code adapted from \url{https://docs.python.org/2/library/itertools.html} that randomly creates the groups.

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{python}
import random

students = ['candrew3',
            'gavelarb',
            'mhumbert',
            'sli12',
            'mlubben',
            'ylv',
            'hma',
            'xmu',
            'skucera',
            'knewcomb',
            'soh3',
            'hsidky',
            'twu2',
            'yzhang33']

fcc_metals = ['Ni', 'Cu', 'Rh', 'Pd', 'Ag', 'Ir', 'Pt', 'Au'] 

def random_combination(iterable, r):
    "Random selection from itertools.combinations(iterable, r)"
    pool = tuple(iterable)
    n = len(pool)
    indices = sorted(random.sample(xrange(n), r))
    return tuple(pool[i] for i in indices)

print '|Group|Students|Metals|'
print '|-'
for i in range(1,8):
   s1, s2 = random_combination(students, 2)
   m1, m2, m3 = random_combination(fcc_metals, 3)
   print '|{0}|{1}, {2}|{3}, {4}, {5}|'.format(i, s1, s2, m1, m2, m3)
   students = [s for s in students if s not in [s1, s2]]
\end{minted}

\begin{center}
\begin{tabular}{rll}
Group & Students & Metals\\
\hline
1 & mhumbert, xmu & Ag, Ir, Pt\\
2 & candrew3, skucera & Pd, Ag, Au\\
3 & soh3, hsidky & Ag, Ir, Au\\
4 & ylv, twu2 & Ni, Pd, Au\\
5 & knewcomb, yzhang33 & Ni, Cu, Au\\
6 & sli12, mlubben & Cu, Rh, Ag\\
7 & gavelarb, hma & Ni, Cu, Pd\\
\end{tabular}
\end{center}


\section{Single Metal Atoms}
\label{sec-1}

Use \texttt{Vasp} to calculate the spin-polarized ground state energy of your atoms. Perform an scf calculation with the atom in a 8\texttimes{}9\texttimes{}10 \AA{} box. Use an plane wave cutoff of 400 eV, the PBE functional, and first order Methfessel-Paxton smearing (\verb~ismear=1~). Let all other parameters be the defaults. What are the electronic configurations of the atoms. Are they consistent with your expectations?

\textbf{Name your calculation directory as '\{0\}-atom'.format(metal), i.e. if your metal is Pd the calculation directory should be called \texttt{Pd-atom}.}

\section{\emph{k}-point convergence}
\label{sec-2}

Now create bulk fcc structures for your metals with the experimental lattice constants. For each structure perform a \emph{k}-point convergence study till you reach a 0.02 eV convergence in the total energy. The other \texttt{INCAR} parameters should be the same as the last question.

Use a (k,k,k) grid where k is in [3, 5, 7, 9, 11].

\textbf{The calculations should be in '\{0\}-kpt-convergence/kpt-\{1\}'.format(metal, k), i.e., for Pd and for k=7 it should be called your calculation should be in \texttt{Pd-kpt-convergence/kpt-7}.} 

\section{Finding bulk metal lattice constants}
\label{sec-3}

Now calculate the optimal PAW/PBE lattice constant for your metals by performing an Equation of State fit. For each metal, use the \emph{k}-point grid where the energy is converged. Refer to the notes of Lab 4 for an example of how to do this. Again, use the \texttt{INCAR} parameters from the previous questions. 

How do your calculated lattice constants compare to the experimental ones?

\textbf{Calculations should be in '\{0\}-EOS/a-\{1\}'.format(metal, lattice)}

\section{Cohesive Energies}
\label{sec-4}

The cohesive energy is the energy of the reaction:

M(g) $\rightarrow$ M(s)

Calculate the cohesive energy of all your metals. How do they compare with experiment?



\section{Surfaces and Surface Energies}
\label{sec-5}

Next you will calculate the surface energy, i.e. the energy to separate the FCC crystal to expose one of its surfaces. You will represent the fcc(111) surface as a (2,2,3) slab with 10 \AA{} of vacuum. Use the optimized lattice constant. Then perform a geometry optimization with \verb~ibrion=2~ and \verb~nsw=20~. 
Use the optimized energy of the slab to calculate the surface energy in eV/\AA{}. The surface energy is defined as,

$\gamma = \frac{E_{slab} - nE_{bulk}}{2A}$

where A is the surface area of the slab, and n is the number of metal atoms in the slab divided by the number of metal atoms in the bulk. $E_{bulk}$ is the energy of the bulk metal. Note that to calculate surface energies, you need symmetric slabs, so do not use any constraints! (We will not use any constraints in this homework).

\textbf{Please perform the calculations in '\{0\}-surface'.format(metal)}

\section{Adsorbates and Adsorption Energies}
\label{sec-6}

One reason to model a slab is to study adsorption at its surface.  For your metals, determine the binding energy of an O atom adsorbed at the 'fcc' site of the fcc(111) surface. 

It is defined as,

$E_{ads} = E_{O+surface} - E_{surface} - 0.5 E_{O_{2}}$

For which metal is O binding most favorable? For which metal is it the least favorable?

\textbf{Please perform the calculations in 'O-on-\{0\}-fcc'.format(metal).}

\section{Density of States}
\label{sec-7}
For each of your metals, plot the density of states projected onto the d-orbitals for an atom of the clean surface, and the 2p projected density of states for the adsorbate oxygen, on the same graph. Remember that you will have to perform additional SCF calculations with \verb~lorbit=10~ (Refer notes for lab 4). Using your three figures, explain why the O binding energy is different for different metals. Do the metal cohesive energies depend on the degree of filling of the metal d-states?

This paper \url{http://dx.doi.org/10.1038/376238a0} might be useful.
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}